app/views/principal/listar_mis_entregables.html.haml

					=link_to "Grupo #{un_entregable.grupo_nro}"
					=link_to "Entrega: #{Entrega.where(:id => un_entregable.entrega_id).first.nombre} "
---
SELECT `entrega`.* FROM `entrega` WHERE `entrega`.`id` = 8 LIMIT 1