app/controllers/principal_controller.rb

SELECT `seccion`.* FROM `seccion` WHERE `seccion`.`materia_id` = 6204
---
  def ajax_buscar_seccion
    materia_id = params[:materia_id]
    @secciones = Seccion.where(:materia_id => materia_id)

SELECT `estudiante_grupo`.* FROM `estudiante_grupo` WHERE `estudiante_grupo`.`entrega_id` = 8 AND `estudiante_grupo`.`estudiante_cedula` = '1234' LIMIT 1
SELECT `entregable`.* FROM `entregable` WHERE `entregable`.`entrega_id` = 8 AND `entregable`.`grupo_nro` = 2
---
  def listar_mis_entregables
    unless params[:entrega_id] || params[:usuario_cedula]
      flash[:mensaje2]="Faltan Parametros"
      render :action => "bienvenida"

      return
    end
    materia_nombre = EntregaSeccion.buscar_materia(params[:entrega_id])
    @titulo_pagina="Entregable de #{materia_nombre}"

    grupo=EstudianteGrupo.where(:entrega_id => params[:entrega_id],:estudiante_cedula => params[:usuario_cedula])

    if(grupo != [])

      grupo=grupo.first
      grupo=grupo.grupo_nro
      @entregable=Entregable.where(:entrega_id => params[:entrega_id], :grupo_nro => grupo)

SELECT `entrega`.* FROM `entrega` WHERE `entrega`.`id` = 8 LIMIT 1
---
  def realizar_entrega
    @titulo_pagina= "Realizar Entrega"
    numero =Entrega.where(:id => params[:entrega_id]).first.numero_max_integrantes

SELECT `estudiante_grupo`.* FROM `estudiante_grupo` WHERE `estudiante_grupo`.`estudiante_cedula` = '1234' AND `estudiante_grupo`.`entrega_id` = 8 LIMIT 1
SELECT MAX(`estudiante_grupo`.`grupo_nro`) AS max_id FROM `estudiante_grupo`
---
  def procesar_realizar_entrega

    tieneGrupo=EstudianteGrupo.where(:estudiante_cedula=> params[:entregable_integrantes],:entrega_id => params[:entrega_id])


    if tieneGrupo!=[]
      bitacora "Tiene #{tieneGrupo}"
      tiene=true

      tieneGrupo=tieneGrupo.first.grupo_nro;

INSERT INTO `grupo` (`entrega_id`, `nro`) VALUES (8, 2)
---
        @nuevoGrupo = Grupo.new
        @nuevoGrupo.entrega_id=entrega_id
        @nuevoGrupo.nro=nGrupo
        @nuevoGrupo.save

INSERT INTO `entregable` (`entrega_id`, `estudiante_cedula_entrego`, `fecha_hora`, `grupo_nro`, `version`) VALUES (8, '---\n- \'1234\'\n- \'8\'\n', '2012-06-24 11:11:03', 1, 1)
---
            bitacora "Se almaceno el integrante #{integrantes} perteneciente al grupo #{nGrupo} de la entrega #{entrega_id}"
            @NgrupoS.save
          else
            @entregable.errors[:base]<<"La cedula del integrante 2 no corresponde a la de un Estudiante."